#specify a directory to install
cask_args appdir: '~/Applications'

# Taps
tap 'homebrew/cask-fonts'
tap 'argon/mas'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'heroku/brew'

# Binaries
brew 'zsh'
brew 'git'
brew 'yarn'
brew 'mas'
brew 'mackup'
brew 'awscli'
brew 'awsebcli'
brew 'cocoapods'
brew 'docker-compose'
brew 'heroku'
brew 'commitizen'
brew 'nvm'

# Development
brew 'node'
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'mysql'
brew 'brew-php-switcher'

# Casks
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'font-fira-code'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'mongodb-compass'
cask 'mysqlworkbench'
cask 'shiftit'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'postman'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Mac Apple Store
mas 'Xcode', id: 497799835
mas 'the-unarchiver', id: 425424353
mas 'slack', id: 803453959